#include <stdio.h>

void main() {
	/*

	1. 프로그램이란?
		-스마트폰, PC, 노트북에서 특정 작업을 위해 지시하는 것

	2. 프로그래머
		-정보기기에서 사용되는 프로그램을 만드는 사람

	3. 프로그래밍 언어
		-프로그램을 개발하기 위해 사용하는 언어

	4. 컴파일러
		-프로그래머와 컴퓨터가 서로 의사 교환을 하기 위해 돕는 통역사

	5. 기계어
		-중앙처리장치(CPU)에 종속되는 언어
		-컴파일러에 의해 프로그램이 기계어로 변환되어 특정 플랫폼에서 실행.

	6. 어셈블리어
		-기계어를 프로그래머가 좀더 이해하기 쉬운 기호 형태로 일대일 대응시킨 프로그래밍 언어
		-기계어 보다 프로그래밍이 훨씬 용이
		-LDA, ADD, STA등 어셈블리 명령어 존재.
	
	7. 저급언어
		-컴퓨터와 CPU에 적합하게 만든 기계어와 어셈블리 언어
		- CPU에 따라 달라지며 특정한 CPU를 기반으로 만듬.

	8. 고급언어
		-cPU 의존 없이 사람이 쉽게 이해하기 위해 만들어진 언어
		-C, 자바, 파이썬과 같은 프로그래밍 언어

	9. 번역기
		-컴파일러: 고급언어-> 기계어 or 목적코드
		-어셈블러: 어셈블리어 -> 기계어

	10. C언어 특징
		-절차지향 언어
		-간편하고 효율적
		-이식성이 좋음
		-다소 어려움
	*/
}