#include <stdio.h>

void main(){
	/* 2주차
	우리가 사용하는 10진수
	-하나의 자릿수에 사용하는 숫자가 0~9

	컴퓨터가 사용하는 2진수
	-수의 자릿수에 사용하는 숫자가 0,1

	비트
	-가장 작은 기본 정보 단위
	-진수인 1과 0으로 비트 표현

	바이트
	-비트가 연속적으로 8개 모인 정보 단위 (1바이트 = 8비트)
	-256가지의 정보 종류 저장

	논리값
	-true, false
	
	부울 대수
	-조지 부울이 제창한 기호 논리학의 한 분야 
	-AND, OR, NOT 연산

	아스키 코드
	-1967년에 표준으로 제정
	-아스키는 초창기에 7비트 인코딩
	-총 128개의 코드로 구성

	유니코드
	-유니코드 협회가 제정하여 1991년 버전 1.0이 발표(16비트로 확장된 코드 체계)
	-1996년 65,536자의 코드 영역을 언어학적으로 분류
	-국제표준화기구(ISO): 계속 수정 보완

	SW 개발 5단계
	-요구 분석, 설계, 구현, 검증, 유지보수
	프로그램 구상 -> 소스 편집 -> 컴파일 -> 링크 -> 실행

	소스파일 or 소스코드
	-프로그래밍 언어로 일련의 명령러가 저장된 파일

	소스 파일 확장자
	-C언어 .c / 자바 .java / C++ .cpp

	컴파일러
	-소스 파일에서 기계어로 작성된 목적파일을 만들어 내는 프로그램 .obj

	링크 or 링킹
	-링커가 수행하는 과정
	-여러 개의 목적 파일을 연결하여 하나의 실행 파일을 생성해 주는 과정 .exe .dll .com

	비주얼 스튜디오는 컴파일과 링크 과정을 하나로 합친 빌드 제공

	라이브러리
	-자주 사용하는 프로그램을 이미 만들어 놓고 사용하는 모듈

	오류: 프로그램 개발 과정에서 나타나는 모든 문제

	발생 시점에 따른 구분
	-컴파일 오류 : 문법 오류
	-링크 오류 : 함수나 라이브러리 함수 이름을 잘못 기술
	-실행 오류 : 실행하면서 오류 발생

	오류의 원인과 성격에 따른 구분
	-구문 오류 : 문법을 잘못 기술 
	-논리 오류 : 원하는 결과가 나오지 않는 오류

	디버깅
	-오류를 찾아 소스를 수정하는 과정
	-디버깅을 도와주는 프로그램 (디버거)

	통합개발환경 IDE
	-프로그램 개발에 필요한 편집기, 컴파일러, 링커, 디버거 등을 통합하여 제공하는 개발환경

	main() 함수
	-프로그램 실행 시 가장 먼저 호출되는 특별한 함수
	
	함수의 형태
	-함수 머리, 함수 몸체
	-사용자 정의 함수
	-라이브러리 함수

	함수 puts()
	-문자열 출력
	함수 printf()
	-문자열, 변수값 출력
	*/
}